[{"slug":"about-graceful-extensibility","title":"About Graceful Extensibility","date":1558107039055,"synopsis":"Experts in resilience engineering have been studying complex systems in high-stakes industries for decades. The Theory of Graceful Extensibility is organized around ten statements which describe properties found in complex systems from medicine, military, transportation, aviation, aerospace, power generation and transmission, and similar industries. The software business has finally caught up with those other industries in terms of complexity, and at the same time has become an essential part of all of those other systems."},{"slug":"adaptive-nature-of-norms","title":"Adaptive Nature of Norms","date":1554870233423,"synopsis":"We're inspired by David Woods' Theory of Graceful Extensibility and have attempted to use it as a yardstick for measuring the long-term adaptability of systems. Here we apply the measure to the best aspects of Extreme Programming which we've described elsewhere as normative good."},{"slug":"agility-or-speed","title":"Agility or Speed","date":1558889155683,"synopsis":"Businesses talk about agile development as a way to go faster. This misunderstands both speed and agility. We offer two videos to hopefully make the differences clear."},{"slug":"agreeing-with-strangers","title":"Agreeing with Strangers","date":1504922520403,"synopsis":"Business is a process for getting things done with people you don't much like. When plans don't work out strangers can fall back on contracts knowing civil courts can be called upon to arbitrate. But how much were those contracts understood in advance? How will increased automation help? Here I reflect on my own experiments."},{"slug":"alan-kay---lindberg-king-lecture","title":"Alan Kay - Lindberg-King Lecture","date":1565885729967,"synopsis":""},{"slug":"alan-kay-on-messaging","title":"Alan Kay On Messaging","date":1578167619254,"synopsis":"Just a gentle reminder that I took some pains at the last OOPSLA to try to"},{"slug":"alan-kays-inspiration","title":"Alan Kay's Inspiration","date":1511285371200,"synopsis":"Alan Kay, in a sprawling interview in Fast Company, talks about some inspirations for his work at PARC.  McLuhan, Montessori, and Papert, among others."},{"slug":"allowance-calculator","title":"Allowance Calculator","date":1533849261928,"synopsis":"Example usage of wiki and the Method Plugin to compute allowances for a couple children.  We annotate this example with commentary about the implementation and some rationale for the computations themselves."},{"slug":"alpha-wiki","title":"Alpha Wiki","date":1413346746000,"synopsis":"<b>alphawiki</b>"},{"slug":"an-lsof-primer","title":"An lsof Primer","date":1526148266436,"synopsis":"The tool is aptly called `lsof` because it \"lists open files\". And remember, in UNIX just about everything (including a network socket) is a file.  _I rarely reach for `lsof` and so cannot remember what I did last time (was I asking networking questions or filesystem questions?), let alone remember what I typed last time.  _[https://danielmiessler.com/study/lsof/ link]"},{"slug":"apparatus","title":"Apparatus","date":1526743175548,"synopsis":"I admire Apparatus which was brought to my attention by Bret Victor, whom I also admire.  Been thinking about how I might connect apparatus to wiki. [https://aprt.us site]"},{"slug":"applied-wiki-player-experience","title":"Applied Wiki: Player Experience","date":1525554870600,"synopsis":"Being a general purpose hypermedia, wiki can be applied to surprising purposes.  Dil Green proposes a workflow design for DarVoz community banking application. [http://dilvoz.outlandish.academy/view/community-currency-policy-scope/view/community-currency-transaction/view/community-currency-transactions-validation/view/community-currency-transactions-validation-balances/view/community-currency-governance-policy-tiers-c lineup]"},{"slug":"approaching-overload","title":"Approaching Overload","date":1558896076114,"synopsis":"Approaching Overload: Diagnosis and Response to Anomalies in Complex and Automated Production Software Systems. Marisa Grayson, in her masters thesis, analyzed four incidents applying process tracing and the above-the-line-below-the-line framework to understand how modern systems development teams diagnose and respond to surprises. The work provides evidence for findings about difficulties with observability in automation and responses to saturation. [https://www.researchgate.net/publication/333091997_Approaching_Overload_Diagnosis_and_Response_to_Anomal"},{"slug":"artist-machine-collaboration","title":"Artist-Machine Collaboration","date":1562944170047,"synopsis":"People make things. You make things. Most of the time you make Very Serious Things™️ that help your bosses sell more shoes or saxophones or those tiny coffee packets. And that’s good, because you gotta eat and stuff. But something else has gotta eat, too: your brain. Music is creation, art is creation, code is creation. I think it’s important to goof around with code sometimes, or make things that let other people goof around with code. And sometimes, that becomes the Very Serious Thing™️. Magenta.js is one of these things; let's talk about it! Monica Di"},{"slug":"assessing-team-health-survey","title":"Assessing Team Health Survey","date":1558275223368,"synopsis":"We compared David Woods' ten abstracted statements in the theory of [[Graceful Extensibility]] to the 73 indicators used to assess team fluency in the agile methods employed within the New Relic product group."},{"slug":"assets-plugin","title":"Assets Plugin","date":1515874817859,"synopsis":"We want a plugin that can show a subdirectory of assets, offer links to those assets, and add more on drop."},{"slug":"async-code-in-a-nutshell","title":"Async Code In A Nutshell","date":1527807283366,"synopsis":"A fairly succinct journey through the many ways javascript developers have learned to cope with asynchrony. Callbacks vs Promises vs RxJS vs async/await [https://www.academind.com/learn/javascript/callbacks-vs-promises-vs-rxjs-vs-async-awaits/ link]"},{"slug":"awareness-through-movement","title":"Awareness Through Movement","date":1559414219176,"synopsis":"A life of carrying tension accumulated in my lower back completely unnoticed. In middle age, roughhousing with children triggered what appeared to be a sudden back injury. Resulting chronic pain led to a search for relief. Awareness Through Movement classes in the Feldenkrais Method provided not only relief, but a gateway to deep understanding of self, and perhaps more surprisingly, understanding of the world. Although perhaps not self-evident, this story is also about complex systems."},{"slug":"becoming-alongside","title":"Becoming Alongside","date":1548953055969,"synopsis":"David Ing, _A philosophy of \"becoming with\" as \"becoming alongside\"_.  After reading this I think I understand better why David chose the domain name coevolving.com. [http://coevolving.com/blogs/index.php/archive/a-philosophy-of-becoming-with-as-becoming-alongside/ blog]"},{"slug":"bit-rot-and-red-queen-effect","title":"Bit-rot and Red Queen Effect","date":1522781374252,"synopsis":"Extreme Programming has grown up into Continuous Deploy, at least for software giants who can afford extreme automation.  Their corresponding contributions to open source accelerate the evolution in the ecosystem.  A small team or individual developer who steps off the upgrade train for a moment finds code that can no longer be built."},{"slug":"blade-runner","title":"Blade Runner","date":1583203332545,"synopsis":"I really enjoyed this movie when I first saw it in high school.  Then in college it was one of four movies required by my favorite class at the College of Environmental Design: Psychology of Architecture (aka psycho architecture).  I enjoyed the class so much I took it again, twice, as a teaching assistant."},{"slug":"blockchain-forecast","title":"Blockchain Forecast","date":1498054823972,"synopsis":"Naval Ravikant thinks philosophically about the nature of networks and how they make decisions. A tweetstorm follows. [https://twitter.com/naval/status/877467629308395521 twitter]"},{"slug":"blockchains-master-key-to-unlock-the-future","title":"Blockchains: Master Key To Unlock The Future?","date":1514477594982,"synopsis":"Beyond crypto - ICO hype & hope - decentralized governance."},{"slug":"boxes-and-arrows","title":"Boxes and Arrows","date":1566411915128,"synopsis":"All designers of all things start first with loosely drawn boxes and lines. Semantics of the boxes and of the lines differ, but the drawings look very similar."},{"slug":"breaking-up-with-your-test-suite","title":"Breaking up (with) your test suite","date":1527893553645,"synopsis":"We have a thousand ways and reasons to test our code. But the sword is double-edged: when reading an unfamiliar test, which of the thousand reasons motivates its presence?  When adding a test, which of the thousand possible methods?  Clarify the test suite by grouping tests based on the value they bring. [http://blog.testdouble.com/posts/2014-05-25-breaking-up-with-your-test-suite.html article] [https://speakerdeck.com/searls/breaking-up-with-your-test-suite slides]"},{"slug":"breathe","title":"Breathe","date":1542298019436,"synopsis":"I teach aikido.  I also use aikido to teach mind-body integration, and peace of mind (or more precisely, peace of self).  The ideas that follow are woven into all of my aikido lessons.  This is the single most important thing I teach.  Breathe."},{"slug":"building-better-futures","title":"Building Better Futures","date":1514996067927,"synopsis":"Video of the Foresight Salon on Blockchain as it pertains to multiple areas of Economy, Government, AI, its power as social force, source for truth, and its ecosystem as role model for security."},{"slug":"building-quality-in","title":"Building Quality In","date":1527893651237,"synopsis":"Elisabeth Hendrickson is the Director of Quality Engineering for Cloud Foundry at Pivotal Labs. She is the award winning author of \"Explore It!: Reduce Risk and Increase Confidence with Exploratory Testing\" and tweets as @testobsessed.  20min video interview & transcript. [http://www.infoq.com/interviews/agile2014-hendrickson-quality interview]"},{"slug":"calculating-machines","title":"Calculating Machines","date":1524854294626,"synopsis":"From Blaise Pascal in the 1600s to Charles Babbage in the first half of the nineteenth century, inventors struggled to create the first calculating machines. All failed—but that does not mean we cannot learn from the trail of ideas, correspondence, machines, and arguments they left behind."},{"slug":"capturing-the-world","title":"Capturing The World","date":1579934459862,"synopsis":"We can get a complete, consistent model of a small piece of the world using Event Sourcing. This is powerful but expensive. Jessica Kerr, aka jessitron [https://blog.jessitron.com/2020/01/24/capturing-the-world-in-software/ blog]"},{"slug":"categories-for-the-working-hacker","title":"Categories for the Working Hacker","date":1523884402266,"synopsis":"Philip Wadler (inventor of Haskell's Type Classes and FP superhero) begins this talk thusly:"},{"slug":"chain-of-command","title":"Chain of Command","date":1543434431296,"synopsis":"I keep referring to this xkcd cartoon in different contexts.  It's time I made a copy here.  [https://xkcd.com/898/ xkcd 898]"},{"slug":"change-incident-analysis","title":"Change Incident Analysis","date":1586189118241,"synopsis":"John Allspaw reviews current software industry practice  for learning from incidents and suggests how we can improve to get more value out of our incidents. [https://www.youtube.com/watch?v=M8mYPyRG1fQ youtube]"},{"slug":"chaos-engineering","title":"Chaos Engineering","date":1588636444261,"synopsis":"Casey Rosenthal and Nora Jones have written a new book on Chaos Engineering with the help of many guest authors. Casey gave a talk on Test In Production which characterizes ways chaos engineering can help software organizations reframe their approach to building reliable systems. In the first ten minutes of the talk he sets out 7 myths of reliability common in current practice, and follows that with two different mental models that help with reframing. [http://shop.oreilly.com/product/0636920203957.do book] [https://www.twitch.tv/videos/607161567 talk]"},{"slug":"chart-of-neural-networks","title":"Chart of Neural Networks","date":1512447815164,"synopsis":"With new neural network architectures popping up every now and then, it’s hard to keep track of them all. So I decided to compose a cheat sheet containing many of those architectures. [http://www.asimovinstitute.org/neural-network-zoo/ post]"},{"slug":"chatham-house-rule","title":"Chatham House Rule","date":1512476752190,"synopsis":"When a meeting, or part thereof, is held under the Chatham House Rule, participants are free to use the information received, but neither the identity nor the affiliation of the speaker(s), nor that of any other participant, may be revealed. [https://www.chathamhouse.org/about/chatham-house-rule page]"},{"slug":"chorus-of-voices","title":"Chorus of Voices","date":1487103987358,"synopsis":"Four distinct concerns surface when designing federated wiki based information communities. We identify each and suggest forces that must be resolved before creative collaboration will take place."},{"slug":"cities-alive-as-hypertext","title":"Cities Alive as Hypertext","date":1511199105175,"synopsis":"As an experiment we've taken an export of production artifacts and written javascript that transforms that to federated wiki hypertext. We describe our pilot process."},{"slug":"claim-shanty","title":"Claim Shanty","date":1503547417237,"synopsis":"A house hastily built on a piece of land in order to legalize a claim to the land."},{"slug":"claude-shannon","title":"Claude Shannon","date":1545874186520,"synopsis":"How Claude Shannon and the Bell Labs Mathematics Department founded the digital age. [https://www.bell-labs.com/claude-shannon/ site]"},{"slug":"clean-transporter","title":"Clean Transporter","date":1504670820297,"synopsis":"This service removes from the journal of any history of items not present in the current story. Drop a page flag to preview a cleaned version."},{"slug":"collaborative-automation","title":"Collaborative Automation","date":1557771733583,"synopsis":"Jessica Kerr, aka [https://twitter.com/jessitron @jessitron], explains how modern software teams must collaborate not only with each other, but with their own tools of automation. We must build systems that are good team players. She introduces the line of representation. Presents Four prerequisites (the pillars of joint activity) and four precautions (ironies of automation). [https://https://blog.atomist.com/principles-of-collaborative-automation/ article]"},{"slug":"collaborative-link","title":"Collaborative Link","date":1494861633502,"synopsis":"The web became more collaborative with wiki's introduction of the [[Internal Link]]. Link names were drawn from a shared space backed up at the time by shared storage. Federated wiki's internal links preserves the shared space but not the shared storage making it the ideal link for the distributed collaborative web."},{"slug":"common-ground-breakdown","title":"Common Ground Breakdown","date":1552849303713,"synopsis":"John Allspaw shared a paper he loves: Common Ground and Coordination in Joint Activity: [http://jeffreymbradshaw.net/publications/Common_Ground_Single.pdf pdf]. Capturing notes here especially for the notion of constant repair of common ground and the fundamental breakdown of common ground. [https://www.youtube.com/watch?v=KgC_N9glqMs youtube]"},{"slug":"complementary-currency","title":"Complementary Currency","date":1515806839170,"synopsis":"Long before I heard about cryptocurrency, I heard about complementary currency..."},{"slug":"compositing-in-camera-on-set","title":"Compositing In-Camera On-Set","date":1583204626591,"synopsis":"With thousands of shots and multiple iterations, compositing becomes a time-consuming endeavor unavailable for a television series. The Holy Grail of visual effects, a necessity for The Mandalorian, was made available with real-time, in-camera compositing. [https://ascmag.com/articles/the-mandalorian asc]"},{"slug":"constructing-explanations","title":"Constructing Explanations","date":1500573791415,"synopsis":"We seek explanation for what a system does and why. Microservices complicate this aspiration when mixed technologies have been assembled over years by evolving teams for changing business purpose."},{"slug":"constructionism","title":"Constructionism","date":1529175427082,"synopsis":"Constructionist learning is when learners construct mental models to understand the world around them. It advocates student-centered, discovery learning where students use information they already know to acquire more knowledge. Students learn through participation in project-based learning where they make connections between different ideas and areas of knowledge facilitated by the teacher through coaching rather than using lectures or step-by-step guidance. [https://en.wikipedia.org/wiki/Constructionism_(learning_theory) wikipedia]"},{"slug":"container-dobbsapparatus","title":"Container dobbs/apparatus","date":1503547047487,"synopsis":"This is my first use of docker's multi-stage build. "},{"slug":"container-patterns","title":"Container Patterns","date":1519512278731,"synopsis":"Let there be names for these things: [https:// slides]"},{"slug":"containerize-candidate-code","title":"Containerize Candidate Code","date":1544661123909,"synopsis":"We're hiring.  We ask candidates to write some code before we talk to them.  Which means we have to run other people's code on our laptops.  Natural incentives should discourage a job hunter from attacking a potential employer.  But I don't trust incentives.  So I've taken to running their code in docker.  You can too."},{"slug":"contours-of-privilege","title":"Contours of Privilege","date":1453133703846,"synopsis":"We consider the landscape of authentication and authorization we desire when everything we own is computerized."},{"slug":"conway-simplify-development","title":"Conway: Simplify Development","date":1548860874155,"synopsis":"Mel Conway says \"It has taken me over fifty years to learn these lessons about simplification of application building.  This paper describes how the lessons showed up.\" [http://melconway.com/Home/pdf/simplify.pdf pdf]"},{"slug":"coordinated-viewing","title":"Coordinated Viewing","date":1550594884321,"synopsis":"We consider what we have and what we might want for coordinating between independent applications."},{"slug":"crc-cards","title":"CRC Cards","date":1538069900481,"synopsis":"I work the machine as I talk to the stakeholders. You say something is important then I write it down. Some cards stay in front of me because they really are important. Some fall off the table never to be missed."},{"slug":"cryptic-economics","title":"Cryptic Economics","date":1521059096702,"synopsis":"There are three types of cryptoassets: stores of value, security tokens, and utility tokens... this essay will focus on utility tokens.  \"New Models for Utility Tokens\": [https://multicoin.capital/2018/02/13/new-models-utility-tokens/ post]"},{"slug":"culture-trust-and-reliability","title":"Culture, Trust, and Reliability","date":1544716663970,"synopsis":"Modern software grows in boundless complexity defying understanding.  Unknown and changing relationships between components emerge in surprising failure.  Technologists, so focused on automation, loose sight of their own collective role in the systems.  It is precisely trust among software communities that will allow us to navigate the vast complexity of our own making."},{"slug":"cybernetics","title":"Cybernetics","date":1557940994477,"synopsis":"Cybernetics is a transdisciplinary approach for exploring regulatory systems, their structures, constraints, and possibilities. In the 21st century, the term is often used in a rather loose way to imply \"control of any system using technology.\" - [https://en.wikipedia.org/wiki/Cybernetics wikipedia]"},{"slug":"cypher-multi-graphs","title":"Cypher Multi-Graphs","date":1542127828563,"synopsis":"CIP2017-06-18:"},{"slug":"dance-another-step","title":"Dance Another Step","date":1518020275725,"synopsis":"With each step we go forward and then to our left."},{"slug":"date-values-and-date-ranges","title":"Date Values and Date Ranges","date":1442207045509,"synopsis":"Time problems present themselves as primarily about the rotation of the planet about its axis, or about the apparent position of the sun and other stars in the sky.  But time problems are also about different positions on the surface of the earth and different positions of the earth about the sun.  Not just time, but also space."},{"slug":"ddd-to-grok-whitehead","title":"DDD To Grok Whitehead","date":1583427015114,"synopsis":"John Bywater has been sharing his journey to understanding Whitehead. In particular, John seems to see in Whitehead a definitive argument supporting the belief that domain-driven design's understanding of event sourcing does provide a general purpose architecture for even the most complex software problems. [https://riot.im/app/#/room/!ORfrUEFeWFcHAMLFLr:matrix.org/$1583190242840150kHOVU:matrix.org?via=matrix.org&via=matrix.allmende.io&via=diasp.in riot]"},{"slug":"debug-cached-service-workers","title":"Debug Cached Service Workers","date":1587922864297,"synopsis":"We encountered a puzzling new symptom while experimenting with local installation of traefik. Here we describe the surprise and related efforts to clean up our browser."},{"slug":"dekker-explains-the-new-view","title":"Dekker Explains the New View","date":1542850306239,"synopsis":"This paper examines how"},{"slug":"deploying-a-wiki","title":"Deploying a wiki","date":1522861119136,"synopsis":"There are lots of ways to deploy Federated Wiki. Here we are just talking about the easiest way to install the Node version to it's own, otherwise empty, Ubuntu 16.04 VPS from Digital Ocean."},{"slug":"design--language","title":"Design & Language","date":1563988239161,"synopsis":"Design patterns are a collection of complex words or phrases whereas pattern language is grammar and idiom that enable self-expression and communication. Design patterns can be studied alone. Pattern language requires a community. There are also design language and programming language both of which also require community."},{"slug":"dismantling-mathematical-privilege","title":"Dismantling Mathematical Privilege","date":1511285467122,"synopsis":"It’s great to be in this room – I am among my people – but also uncomfortable to be here because you all make me really aware of how many people are not in this room. [http://blog.mrmeyer.com/2017/dismantling-the-privilege-of-the-mathematical-1/ link]"},{"slug":"distributed-ses","title":"Distributed SES","date":1548878550531,"synopsis":"On using Ocaps and distributed SES to pass chains of incentives. This reprise post by Mark Miller on Abstracting crypto into “builtin” ocap abstractions. [https://ocapjs.org/t/abstracting-crypto-into-builtin-ocap-abstractions/55 page]"},{"slug":"distributed-systems-theory-","title":"Distributed Systems Theory ","date":1530113478660,"synopsis":"These four readings do a pretty good job of explaining what about building distributed systems is challenging. Collectively they outline a set of abstract but technical difficulties that the distributed systems engineer has to overcome, and set the stage for the more detailed investigation in later sections."},{"slug":"doing-images-symbols","title":"Doing Images Symbols","date":1537453989018,"synopsis":"Alan Kay presented at the Distinguished Lecture Series in 1987: \"Doing with Images makes Symbols\".  The title of the talk comes from ideas from Piaget and Bruner which he doesn't get to until 50 min into the talk.  (The 50 min before that are full of gems including Sketchpad, Englebart's demo, and footage from Xerox PARC): [https://www.youtube.com/watch?v=p2LZLYcu_JY&t=3007 youtube 50:20]"},{"slug":"dot-record-of-wiki-activity","title":"Dot Record of Wiki Activity","date":1582139657901,"synopsis":"A \"dot journal\" is a printed book with otherwise blank pages filled with dots where other journals would have line. They are more commonly called bullet journals because there are many associated productivity methodologies that involve recording bullet lists in such journals. I've been ask, could wiki provide such a record keeping mechanism that is with you everywhere?"},{"slug":"dr-ses","title":"Dr. SES","date":1512932608089,"synopsis":"Bringing Object-orientation to Security Programming (Mark S. Miller, Google) ."},{"slug":"drawing-to-think","title":"Drawing to Think","date":1523493849882,"synopsis":"If you watch what architects actually do when they design, you'll see that all of them draw to think.  At the wiki hangout I shared a bunch of past projects experimenting with ways to draw in browsers.  Here I collect the links with the intent of expanding this into a wiki of its own."},{"slug":"duerers-own-painters-manual","title":"Duerer's own Painters Manual","date":1515088268266,"synopsis":"...the visit to München was spontaneous with only a few hours to spend allowing not enough time to retrieve Duerer’s own copy of the Manual from the air conditioned vaults but I was able to sight an 'Ektachrome' reproduction of the page with 'Man drawing a lute'. As this Ektachrome shows the book opened, two pages are visible. On the right side is the print of 'Lute' but the left page is covered by an inserted loose leaf with a hand written text and sketch by Dürer himself. [https://virtualterritory.wordpress.com/2008/10/02/a-page-out-of-durers-own-copy-"},{"slug":"ecmascript-spec-proposal-for-realms-api","title":"ECMAScript spec proposal for Realms API","date":1524387895265,"synopsis":"# What are Realms?"},{"slug":"edit-music","title":"Edit Music","date":1448569920540,"synopsis":"This d3 with audio web application visualizes and sonifies the wikipedia edit stream. The effect convinces us that something important is happening without saying what that is. [http://listen.hatnote.com/ site]"},{"slug":"el-dorado-ui","title":"El Dorado UI","date":1506707329634,"synopsis":"This is a Sinatra app that provides a UI and canned queries for El Dorado, an enterprise structure warehouse. The web user can retreive results from a menu of queries or author new ad-hoc queries interactively. Results are in the form of tables or diagrams both of which can hyperlink to related queries."},{"slug":"elix-es6-mixins","title":"Elix ES6 Mixins","date":1542521488845,"synopsis":"Proof of concept loading a web component into wiki.  [https://component.kitchen/elix component.kitchen/elix] [https://github.com/elix/elix github]"},{"slug":"embrace-failure","title":"Embrace Failure","date":1507907008564,"synopsis":"The nature of failure is changing, the way our systems behave (or misbehave) as a whole is changing... In order to rise to these challenges successfully, it becomes necessary to ... change the way we build and operate software, [and to change how and what we monitor]"},{"slug":"eric-dobbs","title":"Eric Dobbs","date":1568327412594,"synopsis":"Husband, dad, friend, brother, son, uncle, cousin; programmer, martial artist, teacher, downhill skier, and (probably over-) thinker."},{"slug":"es6-mixins","title":"ES6 Mixins","date":1549374765418,"synopsis":"Jan Miksovsky is an designer/developer expert at component.kitchen on Web Components. Only interested in coding approaches that can be shared with other people. With emphasis on stylin and reuse.  [https://twitter.com/janmiksovsky page]"},{"slug":"ethdenver-hackathon","title":"ETHDenver Hackathon","date":1519004318905,"synopsis":"An etherium hackathon held February 16-18, 2018 at The Sports Castle in Denver [https://ethdenver.com website]"},{"slug":"etsy-facilitation-guide","title":"Etsy Facilitation Guide","date":1560232497473,"synopsis":"Etsy recommend better incident retrospectives with a focus on learning from the incidents. Before the retro review the timeline to prepare initial questions. During the retro, emphasize asking effective questions. Defer focus on remediation for a few days. [https://extfiles.etsy.com/DebriefingFacilitationGuide.pdf pdf]"},{"slug":"eve-tackling-a-giant","title":"Eve Tackling a Giant","date":1527367052528,"synopsis":"With computers so ubiquitous that they live in our pockets, what can we do to help realize the vision of programming for everyone?  How can we Augment Humans (nod to Doug Englebart [[Doug's Demo at 50]]).  Also related to [[The Eve of Abstraction]]"},{"slug":"event-sourcing","title":"Event Sourcing","date":1581525363038,"synopsis":"Design a system by modeling objects as a stream of events.  Instead of saving the current state, save the events that lead up to the current state."},{"slug":"event-storming","title":"Event Storming","date":1532212502810,"synopsis":"An example process from an event storming"},{"slug":"events-on-the-wire","title":"Events on the Wire","date":1486914204201,"synopsis":"Federated wiki combines a collaborative publishing model with individual editing and refactoring convenience. Here we compare events present in our system to the taxonomy of Martin Fowler, et.al. [https://martinfowler.com/articles/201701-event-driven.html post]"},{"slug":"everything-about-objects","title":"Everything About Objects","date":1512920448451,"synopsis":"Everything I really need to know about object-oriented design I could learn on a black-diamond ski run. [http://c2.com/doc/everything.html post]"},{"slug":"everytimzonecom","title":"everytimzone.com","date":1519486950002,"synopsis":"It is devilishly difficult to reason about Time.  Here's a site to see the time instead of trying to do date math in your head. [https://everytimezone.com site]"},{"slug":"experimental-plugin-deployment","title":"Experimental Plugin Deployment","date":1507958436596,"synopsis":"We have Plugmatic which greatly simplifies installing and upgrading published plugins. We ask here, how can we extend this convenience to new plugin development."},{"slug":"explore-ddd-2017","title":"Explore DDD 2017","date":1514907117944,"synopsis":"On New Years Day I spent several hours skimming recordings from the Explore Domain Driven Design Conference held in Denver in 2017.  [https://www.youtube.com/channel/UCcpKGt6MVvz7dISXLlMGmag youtube channel]"},{"slug":"explore-frames","title":"Explore Frames","date":1588528584052,"synopsis":"Collecting notes about using the new frame plugin."},{"slug":"explore-it","title":"Explore It!","date":1511280064735,"synopsis":"Exploratory testing compliments TDD and other test automation.  Especially interested in the structured exploration to guide learning.  [https://pragprog.com/book/ehxta/explore-it book]"},{"slug":"exploring-time","title":"Exploring Time","date":1514956390676,"synopsis":"Most popular software libraries for managing time are based on similar models, and JodaTime, a common Java library being incorporated into Java 9, is a good example. It has a fairly good model, and illustrates the tendency for the first good idea to be the last idea."},{"slug":"exploring-trust","title":"Exploring Trust","date":1502478650965,"synopsis":"Nicky Case created an explorable story about game theory models of trust. [http://ncase.me/trust/ page]"},{"slug":"extreme-modularity-and-security-in-depth","title":"Extreme Modularity and Security in Depth","date":1502767962856,"synopsis":"Object-oriented security programming in javascript by showing how money is a factorial of secure coding. A brilliant video on Distributed Resilient Secure ECMAScript."},{"slug":"fashion-weaponised","title":"Fashion Weaponised","date":1543777826723,"synopsis":"Controversial British political marketing firm Cambridge Analytica weaponised fashion brands to help elect Donald Trump president of the United States, revealed Christopher Wylie, the whistle-blower who earlier this year lifted the lid on the company’s misuse of data belonging to 87 million Facebook users, adding to public distrust of the world’s largest social network. [https://www.businessoffashion.com/articles/news-analysis/cambridge-analytica-weaponised-fashion-brands-to-elect-trump-says-christopher-wylie post]"},{"slug":"fastlys-terrarium","title":"Fastly's Terrarium","date":1542775340931,"synopsis":"Terrarium is a multi-language deployment platform based on WebAssembly. Think of it as a playground"},{"slug":"federated-wiki-already-met-ocap","title":"Federated Wiki already met OCap?","date":1504018338093,"synopsis":"Ward, does wiki deliberately avoid global locks by design?"},{"slug":"federated-wiki-on-dat","title":"Federated Wiki on Dat","date":1537958591521,"synopsis":"We have been interested in developing a variant of the Federated Wiki client that stores wiki in dat sites for some time. After some early experiments, a port of the existing client was made during 2018."},{"slug":"federation-at-risk","title":"Federation at Risk","date":1512867875063,"synopsis":"We consider the risks of building federated wiki or anything else permanent on something as fragile as information."},{"slug":"file-transfer","title":"File Transfer","date":1527791687306,"synopsis":"I like how we've had The Internet for decades, yet \"sending files\" is something early adopters are still figuring out how to do. [https://xkcd.com/949/ xkcd #949]"},{"slug":"five-shot-alphabet","title":"Five Shot Alphabet","date":1548051695091,"synopsis":"Michael Rosenblum explains that video works when it expresses ideas constructed from recognizable elements that form a language."},{"slug":"football-team-tactics","title":"Football Team Tactics","date":1539787353112,"synopsis":"Automatic discovery of tactics in spatio-temporal soccer data. Decroos et al., KDD'18. [https://blog.acolyer.org/2018/10/12/automatic-discovery-of-tactics-in-spatio-temporal-soccer-match-data/ post] [http://www.kdd.org/kdd2018/accepted-papers/view/automatic-discovery-of-tactics-in-spatio-temporal-soccer-match-data paper]"},{"slug":"forms-in-wiki","title":"Forms in Wiki","date":1547059005868,"synopsis":"Here we experiment with [[HTML Form]]s in wiki. We look to hook the HTML plugin into the [[Transporter]] mechanism, such that the [[About HTML Plugin]] takes not of and [[Form Action]] requests, and looks for [[Page JSON]] in the response. If it finds this it renders a [[ghost page]], otherwise it opens an external page if it finds a simple URI, or HTML in the returned JSON."},{"slug":"framed","title":"Framed","date":1550558115147,"synopsis":"Javascript in a framed asset can no longer alter the DOM of the hosting page; here our asset attempts to add a green border around the frame.  Because the frame is sandboxed, the browser will enforce security limits."},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1465160229837,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"goodbye-shannon","title":"Goodbye Shannon","date":1583203166471,"synopsis":"One of my oldest memories is my first day at Open Living School 46 years ago. Shannon Olivarez and I filled a table full of tinker-toy robots. I remember naming my favorite one \"Flyee.\" This many years later that name rings into my mind with special joy and sadness. Shannon flies paragliders and pretty much identifies as a bot—he is \"Flyee\". We were immediately closest of friends, opposite sides of a coin. He's dying. I flew out to say goodbye in person. \"The light the burns twice as bright burns half as long, and you have burned so very, very brightly\""},{"slug":"graceful-extensibility","title":"Graceful Extensibility","date":1558107210107,"synopsis":"The opposite of brittleness in complex systems. David Woods presents a theory of graceful extensibility. This paper is dense and will reward further study. Know that it is not for the faint of heart. "},{"slug":"graph-a-structure-with-graphviz","title":"Graph a Structure with Graphviz","date":1546835415305,"synopsis":"Graphviz will draw a graph composed of nodes and arrows from a declarative text description. Here we describe how to get something up fast and then annotate that with useful debugging results."},{"slug":"graph-plugins","title":"Graph Plugins","date":1489383603007,"synopsis":"We find, store and then render nodes and edges with various layout algorithms."},{"slug":"graphviz-transporter","title":"Graphviz Transporter","date":1535028571255,"synopsis":"This service accepts posts of Graph plugin assembled by the Transport plugin's GRAPH source modifier. It runs Graphviz's dot layout engine and returns an svg image wrapped in the Html plugin."},{"slug":"grow-design-quality","title":"Grow Design Quality","date":1569640593636,"synopsis":"Data visualization designer distills essential takeaways from Edward Tufte’s one-day course. [https://medium.com/data-visualization-society/growing-design-quality-as-data-viz-designer-ff91774e6f9e medium]"},{"slug":"hacking-federated-wiki","title":"Hacking Federated Wiki","date":1448229142109,"synopsis":"Federated wiki is designed to be a growing, moving, sprawling thing that can outlive any advice that I might give here. But start somewhere we must."},{"slug":"history-of-object-capabilities","title":"History of Object Capabilities","date":1538698781384,"synopsis":"Practitioners concerned with solving computer insecurity won't wish to miss this video on how Mark S Millers work has led up to JavaScript at cusp of being a first class object capabilities based programming language."},{"slug":"house-patterns-inventory","title":"House Patterns Inventory","date":1472423182414,"synopsis":"We duplicate an illustration inspired by Timeless Way of Building using our graph building workflow."},{"slug":"how-a-cockpit-remembers","title":"How a Cockpit Remembers","date":1561505843436,"synopsis":"\"How a Cockpit Remembers Its Speeds\". Edwin Hutchins applies cognitive science to a unit of analysis that is larger than one person. A pilot and ethnographer of [flight decks], Hutchins paper is a fascinating deep-dive into an essential moment in the complex socio-technical system of commercial aviation. [http://pages.ucsd.edu/~ehutchins/documents/CockpitSpeeds.pdf pdf]"},{"slug":"how-we-learn-to-program","title":"How We Learn to Program","date":1533759129061,"synopsis":"The internet has had a profound effect on how we learn to program and the practices we employ as programmers every day. We might call this a shift towards a \"digital mind\". See [[Thoughts on the Digital Mind]]"},{"slug":"html-details-tag","title":"HTML Details Tag","date":1543418307736,"synopsis":"Sometimes browsers add features when you're not looking.  See `<details>`. [https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details mozilla]"},{"slug":"human-performance-in-systems","title":"Human Performance in Systems","date":1551155579070,"synopsis":"How Your Systems Keep Running Day After Day. John Allspaw at DevOps Enterprise Summit 2017. [https://www.youtube.com/watch?v=xA5U85LSk0M youtube]"},{"slug":"hypercard--what-is-it","title":"HYPERCARD!  WHAT IS IT?","date":1504674609758,"synopsis":"HYPERCARD!  WHAT IS IT?  IT'S NOT HYPER, IT'S NOT EVEN A CARD. [https://twitter.com/worrydream/status/886439806166683648 tweet]"},{"slug":"image-transporter","title":"Image Transporter","date":1504671205181,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"incremental-pages","title":"Incremental Pages","date":1420343561193,"synopsis":"A wiki buds new pages as the need for them emerges. At this point in creation we challenge our future selves to thoughts beyond our immediate needs else the new remains only a footnote to the old."},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1420512381493,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"insecurity-cameras","title":"Insecurity Cameras","date":1527829714838,"synopsis":"How 1.5 million connected cameras were hijacked to make an unprecedented botnet _(September 2016 [https://motherboard.vice.com/en_us/article/8q8dab/15-million-connected-cameras-ddos-botnet-brian-krebs article])_. Hacked Cameras, DVRs Powered Massive Internet Outage _(October 2016 [https://krebsonsecurity.com/2016/10/hacked-cameras-dvrs-powered-todays-massive-internet-outage/ article])_."},{"slug":"internet-physics","title":"Internet Physics","date":1492361122303,"synopsis":"Born into the world of space travel and atomic energy it would have been easy to have not noticed two inventions that provide the foundation of our modern world: the laser and the transistor. Eagle and Trinity were spectacular then but now out of reach. Whereas fiber optics and integrated circuits manufactured in phenomenal volume every day touch us far more directly."},{"slug":"isolation-without-containers","title":"Isolation without Containers","date":1553874997287,"synopsis":"Eric turned the weekly meeting with Ward toward a rich discussion on software lineage resulting in WASM by sharing this talk on \"Isolation without Containers\" [[Wiki Dev/User Video Chat Oct 31]]"},{"slug":"javascript-modules","title":"Javascript Modules","date":1523218696980,"synopsis":"In the most ubiquitous programming ecosystem, modules have been shoehorned in where they were originally lacking.  As of early 2018, nodejs gradually builds toward ECMAScript Modules.  Guidance for transition from CommonJS to ESM: [https://medium.com/@giltayar/native-es-modules-in-nodejs-status-and-future-directions-part-i-ee5ea3001f71 link]"},{"slug":"javascript-tooling","title":"Javascript Tooling","date":1523297026912,"synopsis":"One definitive answer (of many) for building javascript apps. Plausible recommendations and rationale, if you're just starting out (as of April 2018): use babel, webpack, & gulp.  Wiki's current tools are equally plausible: coffeescript, browserify, & grunt.  Related reading also recommend the yarn and webpack combination.  [http://jamesknelson.com/which-build-system-should-i-use-for-my-javascript-app/ blog]"},{"slug":"javascript-without-pipelines","title":"Javascript Without Pipelines","date":1538061598965,"synopsis":"At JSConf EU 2018, Tara Vancil presented a vision of a web without servers.  Not functions in the cloud but a web browser empowered with peer-to-peer file sharing.  She called it a web without servers.  I also see Javascript without pipelines.  [https://www.youtube.com/watch?v=rJ_WvfF3FN8 youtube]"},{"slug":"joint-cognitive-whiteboard","title":"Joint Cognitive Whiteboard","date":1561649015586,"synopsis":"Yesterday I learned something new to me about joint cognition and socio-technical systems. A group of software engineers gathered around a whiteboard are a joint cognitive system. The scrawls on the board are spatial cues for building a shared model of a complex system."},{"slug":"journal-2017","title":"Journal 2017","date":1527894829011,"synopsis":"Collecting ideas and annotating bookmarks."},{"slug":"journal-2018","title":"Journal 2018","date":1542306001320,"synopsis":"Collecting ideas and annotating bookmarks."},{"slug":"jq","title":"jq","date":1570041829711,"synopsis":"A page in which to collect useful queries for jq. [https://github.com/stedolan/jq github] [https://stedolan.github.io/jq/ site]"},{"slug":"karel-the-robot","title":"Karel The Robot","date":1534432202467,"synopsis":"Wiki hangout brought Karel to my attention.  [http://karel.sourceforge.net/ sourceforge]"},{"slug":"kubernetes--docker-for-mac","title":"Kubernetes & Docker for Mac","date":1525965111620,"synopsis":"Alex Ellis, creator of OpenFaaS, takes new kubernetes features for a spin in Docker for Mac by installing OpenFaaS and Helm.  It happens I'm interested in experimenting with all three of Kubernetes, OpenFaaS, and Helm.  Handy.  (Also covers some of the docker swarm integration... click the link if you wanna see that) [https://blog.alexellis.io/docker-for-mac-with-kubernetes/ link]"},{"slug":"kubernetes-configmap","title":"Kubernetes ConfigMap","date":1502290852747,"synopsis":"Kubernetes docs describe configuring pods with ConfigMaps.  [https://kubernetes.io/docs/tasks/configure-pod-container/configmap/ doc]"},{"slug":"lambdatalk","title":"Lambdatalk","date":1538409703896,"synopsis":"Often the federation explores interesting things.  A while back I remember seeing a lisp implementation in javascript.  I didn't have enough time to explore when I first saw it and it slipped from memory.  This weekend lambdatalk resurfaced when I had some time to explore.  Here I begin sketching an integration with wiki. [http://lambdaway.free.fr/lambdaspeech lambdatalk]"},{"slug":"langsec","title":"LangSec","date":1490648332023,"synopsis":"The Language-theoretic approach (LANGSEC) regards the Internet insecurity epidemic as a consequence of ad hoc programming of input handling at all layers of network stacks, and in other kinds of software stacks. [http://langsec.org/ site]"},{"slug":"law-of-fluency","title":"Law of Fluency","date":1579465471568,"synopsis":"Expertise hides the effort in work — Richard Cook paraphrasing David Woods' Law of Fluency"},{"slug":"lean-into-fear","title":"Lean into Fear","date":1544476603247,"synopsis":"Last weekend I had to lean into fear."},{"slug":"learning-from-incidents","title":"Learning From Incidents","date":1559226687127,"synopsis":"SNAFUcatchers and the resilience engineering community tell us seemingly contradictory things.  Five Whys will mislead you. There is no Root Cause. MTTR is a meaningless metric. Go learn from your Incidents.  If we can't ask five whys or look for root cause and can't trust our metrics, how do we learn from Incidents?"},{"slug":"learning-with-wiki","title":"Learning With Wiki","date":1558323625860,"synopsis":"An experience report from several years of living and learning with wiki. Wiki is a medium in which I construct my own knowledge and understanding. I learn as I go. I build on what I have learned before. I build on what I have learned from others. As I construct and grow, my collaborators, with deeper insight into my interests, draw my attention to other sources. We construct shared knowledge while building our individual thinking."},{"slug":"learning-with-wiki-code","title":"Learning With Wiki Code","date":1558324069033,"synopsis":"An experience report from several years of living and learning with wiki. Before I learned of the federation, I was experimenting with turtle geometry in web browsers. I discovered a need for turtle authors to share drawings (which are also programs) & primitives (which are a lot like functions). Although, I have yet to bring my geometry experiments to wiki, the meandering journey of learning and exploring has been deeply rewarding."},{"slug":"ledger-for-oldest-child","title":"Ledger for Oldest Child","date":1533847983422,"synopsis":"Example ledger to complete computations in [[Allowance Calculator]]."},{"slug":"ledger-for-youngest-child","title":"Ledger for Youngest Child","date":1533848031360,"synopsis":"Example ledger to complete computations in [[Allowance Calculator]]."},{"slug":"let-it-fail","title":"Let it Fail","date":1504712965915,"synopsis":"There’s something rather unique in Erlang in how it approaches failure compared to most"},{"slug":"life-with-transistors","title":"Life with Transistors","date":1492361173661,"synopsis":"The electronic age grew out of the electrical age when devices were applied to information as well as industrial effort. Individually not much different than the electron tube in its decision making ability the transistor had the advantage that it could be fabricated in mass and its information processing power compounded."},{"slug":"line-of-representation","title":"Line of Representation","date":1558131582465,"synopsis":"As technologists we have a narrow view of The System we're operating to serve our customers. We think and discuss in great detail all the technical components: network cables, routers, wireless access points, racks, blades and chassis and power supplies, and hypervisors, virtual machines, containers, orchestration, load balancers, all of the above in cloud providers, domain names, TLS certificates, etc. Most of us think of ourselves as outside of the system, but we and our teams and groups and divisions are, in fact, the most essential source of resilien"},{"slug":"link-word","title":"Link Word","date":1509399767436,"synopsis":"Wiki has a distinct markup for links that go to pages outside the wiki. Here we suggest a style for using that markup that suites both writer and reader."},{"slug":"livable-code","title":"Livable Code","date":1548953083405,"synopsis":"Sarah Mei presented at Rocky Mountain Ruby September 2017.  Establishing a new metaphor for software development.  Teams work better if you think of them as a theater company.  Code bases work better if you think of them as somewhere you live.  Your (theatrical) team are your roommates.  [https://www.youtube.com/watch?v=8_UoDmJi7U8 youtube]"},{"slug":"login-to-view","title":"Login to View","date":1535323297177,"synopsis":"We imagine controlling visibility of wiki pages on a site or farm similar to operating a server on a private LAN but using distinguished logins rather than network access."},{"slug":"logistic-curve","title":"Logistic Curve","date":1416682074753,"synopsis":"Up until March 2007, many people believed Wikipedia's growth to be exponential. Changes in the rate of growth has prompted a re-evaluation of that, and the current belief is that Wikipedia's growth fits a logisitic-linear growth model."},{"slug":"lsof","title":"lsof","date":1587923328363,"synopsis":"A page in which to collect useful queries for lsof. [https://danielmiessler.com/study/lsof primer]"},{"slug":"make-a-new-plugin","title":"Make a New Plugin","date":1551105221225,"synopsis":"We'll take notes as we make a new plugin. We're working in the context of a dockerized local farm.  (For non-docker versions, you might check the twins above.)"},{"slug":"make-plugin-script","title":"Make Plugin Script","date":1569682193876,"synopsis":"The make plugin script will create files for a new plugin to handle items of a new type. The files include an about page with an example of the new item type ready to be rendered by the new plugin. [https://wiki.dbbs.co/assets/scripts/mkplugin.sh coffee] [https://wiki.dbbs.co/assets/scripts/mkplugin.js.sh javascript]"},{"slug":"manage-distributed-development","title":"Manage Distributed Development","date":1519536601583,"synopsis":"Beaker browser community ask questions about how independent developers can introduce changes to data structures without breaking each other's things.  The discussion touches on issues that will be familiar, and overly complicated, to wiki developers. [https://github.com/beakerbrowser/beaker/issues/820 github]"},{"slug":"measured-daylight-hours","title":"Measured Daylight Hours","date":1512967621864,"synopsis":"This time of year folks start noticing the days getting longer. How much longer they wonder? I know because I measure every day from my own backyard. [http://c2.com/~ward/arduino/SensorServer/results/a2010/history.txt data]"},{"slug":"medical-teamwork-reviewed","title":"Medical Teamwork Reviewed","date":1563118094245,"synopsis":"The aim of this critical review is to contrast prevailing approaches to teamwork in healthcare with current concepts in safety science. After identifying relevant articles through multiple formal search methods, we found that, although current teamwork literature acknowledges a lack of comprehensive investigations linking team training in healthcare and patient outcomes, the predominant strategy to achieve safety remains a traditional, reactive approach that regulates behaviour and constrains performance variability. [https://link.springer.com/article/10"},{"slug":"memory-amplifier","title":"Memory Amplifier","date":1546839429449,"synopsis":"I've developed writing and searching strategies that help me remember thoughts I've had year after year. [https://riot.im/app/#/room/#fedwiki:matrix.org/$15467364462192225lnRiN:matrix.org post]"},{"slug":"metaparticleio","title":"Metaparticle.io","date":1519513934396,"synopsis":"The metaparticle project which aims to encapsulate common patterns of use in kubernetes.  See [https://metaparticle.io/ link]"},{"slug":"midpoint-circle-algorithm","title":"Midpoint Circle Algorithm","date":1519522823125,"synopsis":"Midpoint circle algorithm is an algorithm used to determine the points needed for rasterizing a circle. Bresenham's circle algorithm is derived from the midpoint circle algorithm. [https://en.wikipedia.org/wiki/Midpoint_circle_algorithm wikipedia]"},{"slug":"miller-dr-sesing","title":"Miller Dr SESing","date":1512683614821,"synopsis":"Prior to The Next Frontier symposium in SF on 7/3/2017. Mark was meeting speakers. [https://twitter.com/zooko/status/88167051430918963 page]"},{"slug":"mind-the-overlap","title":"Mind the Overlap","date":1500842864374,"synopsis":"Iterative development works best when design and implementation co-evolve gracefully in the presence of late discovery. Adam Solove suggests that shared enumeration of control states and state transitions will provide the necessary coordination. [https://medium.com/@asolove/pure-ui-control-ac8d1be97a8d medium]"},{"slug":"more-agile-than-agile","title":"More Agile than Agile","date":1558129184743,"synopsis":"I presented a poster session at the 2019 New Relic Product Offsite entitled \"More Agile than Agile: Learning from Incidents\". The story draws heavily from resilience engineering, especially the Stella Report and the Theory of Graceful Extensibility. Here we elaborate on three sections in the poster itself, the three main ideas to take away, and a call to action for teams at New Relic which almost certainly apply more broadly in the software industry."},{"slug":"most-beautiful-program-ever","title":"Most Beautiful Program Ever","date":1529526773220,"synopsis":"William E. Byrd explores what he considers to be the most beautiful program ever written – a Lisp interpreter written in Lisp – and a few of the many amazing ideas related to this metacircular interpreter."},{"slug":"narrative-humility","title":"Narrative Humility","date":1585851458123,"synopsis":"Thaler Pekar describes the courage behind Narrative Humility, and why asking for stories yields great insight. This is an excerpt from a breakfast program she delivered at DHR communications and public affairs in Dublin, Ireland. [https://www.youtube.com/watch?v=w7OnS9oRKeM youtube] (1m8s)"},{"slug":"nodes-mistakes","title":"Node's Mistakes","date":1531190802582,"synopsis":"Node.js creator Ryan Dahl voiced some deep misgivings about his server-side JavaScript runtime engine at the EU JS conference earlier this week in Germany. [https://thenewstack.io/node-js-creator-blasts-node-js-offers-a-secure-typescript-based-alternative/ post]"},{"slug":"not-so-easy-to-learn","title":"Not So Easy to Learn","date":1515807660014,"synopsis":"Don Norman suggests everyday things should have sufficient affordances that they do not need printed instructions. PUSH vs PULL on doors, for example."},{"slug":"npm-requireresolve","title":"npm require.resolve","date":1563118744644,"synopsis":"require.resolve follows npm’s rules for requiring packages, but provides the absolute path to the package instead of loading the code. When we tried having wiki-server require.resolve wiki-client directly, it failed  because we don’t declare a 'main' script in 'package.json' and we don’t provide the default 'index.js' either (because it’s all client side code). However, all npm packages have a 'package.json'. We can always require.resolve 'wiki-client/package.json' to resolve the location of that file on disk."},{"slug":"object-orientation-revisited","title":"Object Orientation Revisited","date":1561316745274,"synopsis":"Nygaard and Dahl invented Simula’s classes and objects to master complex problems. [[Alan Kay]] invented object orientation (OO) with its networks of communicating objects to facilitate simple and powerful mental models. His goal was to make computers and programming comprehensible to children of all ages."},{"slug":"observable","title":"Observable","date":1532215686754,"synopsis":"@mbostock offers a five minute introduction: [https://beta.observablehq.com/@mbostock/five-minute-introduction link]"},{"slug":"on-beauty-in-place-and-code","title":"On Beauty in Place and Code","date":1523021721975,"synopsis":"Michael Mehaffy and Ward Cunningham discuss some of the more subtle influences in their work and how much of it can be traced to work by Chris Alexander."},{"slug":"ontology-v-stigmergy","title":"Ontology v. Stigmergy","date":1561323126072,"synopsis":"By day I struggle to bring order to increasing complex and disorganized information while on nights and weekends I let [[Collaborative Link]]s do this work for me."},{"slug":"open-data-and-supply-chains","title":"Open Data and Supply Chains","date":1514311116836,"synopsis":"Wiki was founded with an eye towards sustainability of global manufacturing. We continue to bump into organizations with similar goals."},{"slug":"operational-benefit-of-tdd","title":"Operational Benefit of TDD","date":1548003779682,"synopsis":"Because the power of TDD is operational rather than artifactual, test-before provides several benefits over test-after."},{"slug":"orders-of-growth","title":"Orders of Growth","date":1541442269497,"synopsis":"Orders of Growth, Keith Conrad"},{"slug":"origin-of-digits","title":"Origin of Digits","date":1545873231741,"synopsis":"Digital encoding, as opposed to analog, was born of the necessity of encrypting two-way radio in WWII.  A story of heroic engineering at Bell Labs."},{"slug":"our-first-kubernetes-outage","title":"Our First Kubernetes Outage","date":1502295776158,"synopsis":"This is public postmortem for an a complete shutdown of our internal Kubernetes cluster. [https://engineering.saltside.se/our-first-kubernetes-outage-c6b9249cfd3a post]"},{"slug":"parable-of-the-polygons","title":"Parable of the Polygons","date":1563129381008,"synopsis":"This is a story of how harmless choices can make a harmful world."},{"slug":"paxos-visualized","title":"Paxos visualized","date":1527807473736,"synopsis":"This is an explanation and demonstration of an extraordinarily neat algorithm called Paxos. Paxos is a family of algorithms for teaching a whole bunch of decidedly unreliable processes to reliably decide on stuff. [http://harry.me/blog/2014/12/27/neat-algorithms-paxos/ link]"},{"slug":"peer-into-the-minds-eye","title":"Peer Into The Mind’s Eye","date":1557112781636,"synopsis":"Neuroscientists Peer Into The Mind’s Eye. Science Friday. 2019-05-03. [https://www.sciencefriday.com/segments/neuroscientists-peer-into-the-minds-eye/ show] [https://www.cell.com/cell/fulltext/S0092-8674(19)30391-5 study]"},{"slug":"perl-out-loud","title":"Perl Out Loud","date":1562607692357,"synopsis":"Emily Shea writes perl using speech recognition. After all the other RSI interventions failed, she found ways to make voice recognition work. You can read about it, but there's nothing quite as compelling as listening to her program by voice. [https://www.youtube.com/watch?v=Mz3JeYfBTcY youtube] [https://thenewstack.io/perl-programmer-pioneers-coding-by-voice/ article]"},{"slug":"photosynth-hacked-my-brain","title":"PhotoSynth Hacked my Brain?","date":1583427148507,"synopsis":"In 1993-4, my final year at University of Colorado, I created a prototype to derive 3D computer models from photographs using AutoCAD 10 and AutoLISP. A demo of PhotoSynth at TED2007 lead me to wonder if someone had hacked my brain. [http://dobbse.net/thinair/2007/06/photosynth.html blog]"},{"slug":"playwright","title":"Playwright","date":1579748397778,"synopsis":"Playwright is a Node library to automate the Chromium, WebKit and Firefox browsers. Playwright is focused on enabling cross-browser web automation platform that is ever-green, capable, reliable and fast. Our primary goal with Playwright is to improve automated UI testing by eliminating flakiness, improving the speed of execution and offering insights into the browser operation. Playwright runs headless versions of these browsers by default, but can be configured to run the full versions. [https://www.npmjs.com/package/playwright npm] [https://github.com/"},{"slug":"plugin-versioning-and-paragraph-data","title":"Plugin Versioning and Paragraph Data","date":1505686337612,"synopsis":"It seems rather likely this material has been discussed before.  But I'll jot these thoughts here as a placeholder for my own further inquiry."},{"slug":"preparing-to-code","title":"Preparing to Code","date":1505703234242,"synopsis":"I'm excited to pair program with Ward on Wednesday.  Collecting some things in support of that project."},{"slug":"presenting-robust-composition","title":"Presenting Robust Composition","date":1513189948820,"synopsis":"Papers We Love."},{"slug":"private-npm-registry","title":"Private NPM Registry","date":1511535561531,"synopsis":"A private NPM registry might faciliate [[Experimental Plugin Deployment]].  This began life in a conversation on github about wiki plugin development and npm scopes.  [https://github.com/fedwiki/wiki/issues/106/ link]"},{"slug":"private-pods","title":"Private Pods","date":1512480453602,"synopsis":"Imagine influential authors writing freely together in private with the understanding that they are free to remake any part of their collective work as their own citing only the pod, not the individual authors who once shared in private. How would this work?"},{"slug":"programming-with-visible-data","title":"Programming with Visible Data","date":1548859941308,"synopsis":"PANE is a live, functional programming environment built around data-visibility. In PANE, all intermediate values are visible by default, and you construct a program by acting on these concrete values. [http://joshuahhh.com/projects/pane/ link]"},{"slug":"public-side-of-wiki","title":"Public Side of Wiki","date":1512486370142,"synopsis":"Wiki is by nature public. Wiki, you might think is all about sharing freely, and loving the limelight, praising the openess. But this is not so. Wiki has a private side."},{"slug":"publishing-ticktock","title":"Publishing TickTock","date":1518923029471,"synopsis":"Want to tell a story about the steps to getting apparatus containerized and published behind a reverse proxy so I could host my own diagrams."},{"slug":"random","title":"Random","date":1572450858636,"synopsis":"A place to collect quick notes"},{"slug":"recent-changes","title":"Recent Changes","date":1525620078040,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]], [[About Activity Plugin]], [[Recycled Pages]], [http://wiki.dbbs.co/federation-search.html Federation Search]."},{"slug":"reflection-2014","title":"Reflection 2014","date":1512755634864,"synopsis":"Collecting thoughts from years past."},{"slug":"reflection-2017","title":"Reflection 2017","date":1512329624498,"synopsis":"Gathering my own thoughts, often inspired by things collected in [[Journal 2017]]"},{"slug":"reflection-2018","title":"Reflection 2018","date":1538757471791,"synopsis":"Gathering my own thoughts, often inspired by things collected in [[Journal 2018]]"},{"slug":"reflections-on-graphviz-plugin","title":"Reflections on Graphviz Plugin","date":1556725012992,"synopsis":"Excited and inspired by this collaboration with Ward Cunningham. Here we share a branching story of branching graphs in hopes of revealing federated wiki as a surprisingly powerful medium for learning."},{"slug":"reflective-interviews","title":"Reflective Interviews","date":1539968489970,"synopsis":"It is easier to get a creative person to explain their creativity in the context of an actual creative event. Describe the kind of creativity that interests you then seize from their recollections the event most likely to touch your interests."},{"slug":"registration-workflows","title":"Registration Workflows","date":1510063762299,"synopsis":"Here we think through how one could host a wiki farm for themselves and friends without opening hosting for the world. [https://riot.im/app/#/room/#fedwiki:matrix.org/$15098118261302156xrASH:matrix.org riot]"},{"slug":"remote-rendering-of-graphs","title":"Remote Rendering of Graphs","date":1518743907083,"synopsis":"The Graph plugin captures small graph fragments that can be selected and merged by other plugins to do as they see fit. We transport these to a Graphviz service that returns SVG that can be copied about the federation."},{"slug":"resilience-is-a-verb","title":"Resilience is a Verb","date":1558549948250,"synopsis":"David Woods presentation discusses how resilience engineering studies in real settings have revealed patterns in adaptation in complex networks and discovered surprising new fundamentals about how all adaptive systems work — fundamentals that overturn assumptions made by many disciplinary areas of study."},{"slug":"results-by-theorem","title":"Results by Theorem","date":1558047989087,"synopsis":"We classify team health indicators by Woods' psudo-theorems conducting the experiment multiple times."},{"slug":"rethinking-reactivity","title":"Rethinking Reactivity","date":1559577598176,"synopsis":"Svelte 3. Rich Harris. Rethinking Reactivity. [https://svelte.dev/blog/svelte-3-rethinking-reactivity blog] [https://svelte.dev/ site] [https://youtu.be/AdNJ3fydeao youtube]"},{"slug":"rhythm-autonomy-mastery-purpose-safety","title":"Rhythm Autonomy Mastery Purpose Safety","date":1510061670207,"synopsis":"[https://twitter.com/geepawhill @GeePawHill] had a tweestorm about RAMPS [https://storify.com/GeePawHill/a-sense-of-urgency storyify]"},{"slug":"risk-of-serious-inquiry","title":"Risk of Serious Inquiry","date":1524853347932,"synopsis":"A series of articles and deep reflection of Feldenkrais Method by Dennis Leri [http://semiophysics.com/SemioPhysics_Articles_risk_list.html link]"},{"slug":"salience-network","title":"Salience Network","date":1533510282452,"synopsis":"The salience network is a large scale network of the human brain that is involved in detecting and filtering salient stimuli, as well as in recruiting relevant functional networks. [https://en.wikipedia.org/wiki/Salience_network wikipedia]"},{"slug":"save-share-revist","title":"Save, Share, Revist","date":1548365628943,"synopsis":"In early January 2015, Mozilla UX conducted user research to refresh their understanding of how people save, share, and revisit content.  People are happy with simple techniques they understand, using multiple tools, and aren't especially interested in revamping their process. [https://blog.mozilla.org/ux/2015/02/save-share-revisit/ link]"},{"slug":"search-optimized","title":"Search Optimized","date":1474673763852,"synopsis":"I've been writing here long enough to find myself searching for pages I'd written years ago. It is getting easier because I've adopted techniques that make the hunt more effective."},{"slug":"secure-automata","title":"Secure Automata","date":1549040992627,"synopsis":"Language-theoretic security (LangSec) is a design and programming philosophy that"},{"slug":"secure-cooperation-picture-book","title":"Secure Cooperation Picture Book","date":1514989030776,"synopsis":"Secure your code by applying the Principle of Least Authority (POLA) and Delegation in these models of secure cooperation.  [http://erights.org/talks/efun/SecurityPictureBook.pdf pdf]"},{"slug":"seeing-the-invisible","title":"Seeing the Invisible","date":1542302773286,"synopsis":"Seeing the Invisible: Perceptual-Cognitive Aspects of Expertise.  Novices see only what is there; experts see what is not there. [http://cmapspublic3.ihmc.us/rid=1G9NSY15K-N7MJMZ-LC5/SeeingTheInvisible.pdf pdf]"},{"slug":"seeking-categories-in-the-brain","title":"Seeking Categories in the Brain","date":1539792198856,"synopsis":"This is a great graphic by Simon Thorpe describing human visual cortex pipeline and latencies involved. [https://twitter.com/sytelus/status/1036506218947170304/photo/1 twitter]"},{"slug":"seymour-papert","title":"Seymour Papert","date":1529176020057,"synopsis":"Papert used Jean Piaget's work in his development of the Logo programming language while at MIT. He created Logo as a tool to improve the way children think and solve problems. Papert went on to create the Epistemology and Learning Research Group at the MIT Architecture Machine Group which later became the MIT Media Lab. Here, he was the developer of a theory on learning called [[constructionism]], built upon the work of Piaget in constructivist learning theories. [https://en.wikipedia.org/wiki/Seymour_Papert wikipedia]"},{"slug":"shell-games","title":"Shell Games","date":1551798114718,"synopsis":"Sometimes Unix pipe operator and streams and filters are the right tool for the job. This page may grow into a collection of interesting combinations."},{"slug":"simultaneous-adaptation","title":"Simultaneous Adaptation","date":1586614815872,"synopsis":"This leads us to a non-intuitive but fundamental conclusion that all adaptive systems simultaneously are:"},{"slug":"snowshoes-win-in-ski-town-usa","title":"Snowshoes win in Ski Town USA","date":1562722304762,"synopsis":"Family legend has it that Granddad raced a fella from the top of Rabbit Ears Pass to downtown Steamboat Springs to settle a bet about snowshoes vs skis. My uncle recalls climbing a light pole to watch the finish and was crushed when the other fella showed up first. He didn't know that the race was timed, not head-to-head. Today, my aunt emailed me a link to the paper which confirms the legend! The paper has Granddad winning by 30 seconds, but seems like the route was shorter than the legend. [https://wiki.dbbs.co/assets/showshoes-win-in-ski-town-usa/The%"},{"slug":"society-of-mind","title":"Society of Mind","date":1561323516346,"synopsis":"To explain the mind, we have to show how minds are built from mindless stuff, from parts that are much smaller and simpler than anything we'd consider smart. Marvin Minsky."},{"slug":"solid-programmers","title":"Solid Programmers","date":1515077594522,"synopsis":"I often draw symbols like these in 2d with circles, squares, trapezoids shaded in gradient gray."},{"slug":"solution-to-triple-cross","title":"Solution to Triple Cross","date":1532207776693,"synopsis":"Author presents solutions to Triple Cross and the related Port to Port puzzle.  Hidden behind links are javascript implementations of the puzzles.  Re: Triple Cross: \"This solution was constructed by using computer searches to find sequences that move specific tiles without moving others. This means it is mostly just lists of sequences without any visible underlying strategy. If anyone has a more transparent method, I would like to know about it.\"  [https://www.jaapsch.net/puzzles/port.htm post]"},{"slug":"solve-for-initial-conditions","title":"Solve for Initial Conditions","date":1482337289806,"synopsis":"The g9 library will adjust algorithmic drawings such that any element can be moved. When someone interacts with the graphics, for example by trying to drag an element to a new position, g9 optimizes over the space of possible values for your data to find a set of values that comes closest to creating the change. From MIT. [http://omrelli.ug/g9/gallery/ post]"},{"slug":"sowing-apparatus","title":"Sowing Apparatus","date":1513090626335,"synopsis":"How to connect [[Apparatus]] and wiki?  I find myself stalled in this question.  Here, I write to think as a first tiny step.  Can I build some momentum?"},{"slug":"spawn-or-not","title":"Spawn or Not","date":1512754228892,"synopsis":"Separate concerns of code structure from runtime structure in Elixir.  Use functional decomposition for the former, and processes for the latter. [http://theerlangelist.com/article/spawn_or_not link]"},{"slug":"splunk-at-jeffco-schools","title":"Splunk at JeffCo Schools","date":1542040916314,"synopsis":"I went to a Splunk event in Denver a couple years ago.  This story has stuck around in my mind for a while."},{"slug":"stafford-beer","title":"Stafford Beer","date":1557937459784,"synopsis":"__Stafford Beer__ (born __Anthony Stafford Beer__, 25 September 1926 – 23 August 2002) was a British theorist, consultant and professor at the Manchester Business School. He is best known for his work in the fields of operational research and management cybernetics - [https://en.wikipedia.org/wiki/Stafford_Beer wikipedia]"},{"slug":"story-of-advancers","title":"Story of Advancers","date":1533758939379,"synopsis":"Brian Marick says, I'm especially interested in the stories that peers tell each other to reinforce a style of working and body of practical knowledge. Ward's story of \"method object\" is a good example. [http://www.exampler.com/old-blog/2004/08/11/index.html#advancers post]"},{"slug":"surprising-stability","title":"Surprising Stability","date":1452965655807,"synopsis":"I wrote an oscillating program of two variables where a small part of each feeds into the other. I expected it to explode to infinity or collapse to zero but neither happened. This says modern floating point calculation is pretty darn good."},{"slug":"system-dynamics","title":"System Dynamics","date":1542432325483,"synopsis":"Here I transcribe a conversation with Michael Mehaffy regarding modeling complex systems with quantitative patterns in federated wiki."},{"slug":"table-of-contents","title":"Table of Contents","date":1526678766164,"synopsis":"The most recent things (my blog) can be found in [[Recent Changes]].  I generally (dis)organize this wiki around Journal entries or Reflections.  Click the button to find these entry points."},{"slug":"tdd-where-did-it-all-go-wrong","title":"TDD: Where did it all go wrong?","date":1527893625628,"synopsis":"Ian Cooper reminds what was Kent's original proposition on TDD, what misunderstandings occurred along the way and suggests a better approach to TDD, one that supports development rather impeding it. 63min video & slides. [https://www.infoq.com/presentations/tdd-original presentation]"},{"slug":"teaching-kubernetes","title":"Teaching Kubernetes","date":1502292452709,"synopsis":"Teach people to deploy existing containerized applications to Kubernetes. The target audience have experience with problems of scaling their deploy processes; internal networking; handling traffic from the public internet; autoscaling containers; and general ops of non-monolithic container architecture. [http://blog.slashdeploy.com/2017/02/19/teaching-kubernetes/ post]"},{"slug":"test-counting-with-method","title":"Test Counting With Method","date":1518152776122,"synopsis":"We want to count how many times this page appears in the lineup. The question is, how to initialize the count."},{"slug":"testing-graphviz-plugin","title":"Testing Graphviz Plugin","date":1551900704016,"synopsis":"See [[About Graphviz Plugin]]"},{"slug":"testing-microtalk","title":"Testing Microtalk","date":1519511250951,"synopsis":"We try a few examples of microtalk, a subset of lambdatalk, a dialect of lisp."},{"slug":"the-eve-of-abstraction","title":"The Eve of Abstraction","date":1526684454864,"synopsis":"How might programming language design break free from its long history of shuffling syntax around disturbingly similar semantics? Here are two folks reporting the related steps they have made on their escape. [http://early.witheve.com/ site]"},{"slug":"the-illustrated-childrens-guide-to-kubernetes","title":"The Illustrated Children's Guide to Kubernetes","date":1540072690697,"synopsis":"YOUTUBE 4ht22ReBjno"},{"slug":"the-learning-scientists","title":"The Learning Scientists","date":1560191374555,"synopsis":"We are cognitive psychological scientists interested in research on education. Our main research focus is on the science of learning. (Hence, \"The Learning Scientists\"!) Our Vision is to make scientific research on learning more accessible to students, teachers, and other educators. [http://www.learningscientists.org/ site]"},{"slug":"the-science-of-insecurity","title":"The Science of Insecurity","date":1549041149206,"synopsis":"Why are the overwhelming majority of common networked software still not secure, despite all effort to the contrary? Why is it almost certain to get exploited so long as attackers can craft its inputs? Why is it the case that no amount of effort seems to be enough to fix software that must speak certain protocols?"},{"slug":"the-sundance-lab","title":"The Sundance Lab","date":1566414191796,"synopsis":"In the early 90's there was a room upstairs in the University of Colorado's College of Architecture and Planning. Taped to the door was a picture of Butch and Sundance making their big, movie-ending leap off the cliff. Inside, the room was spacious with high ceilings and large windows with northern light and was full of computers around the perimeter. The lab had the first color laser printer on campus, a Cannon ZapShot—one of the earliest digital cameras—a few wacom tablets, and even a few early tablet computers. The internet still has some information "},{"slug":"tiddly-meets-erlang","title":"Tiddly Meets Erlang","date":1547049842825,"synopsis":"Joe Armstrong & Jeremy Ruston - Intertwingling the Tiddlywiki with Erlang. [https://jermolene.com/intertwingling site]"},{"slug":"time-theft","title":"Time Theft","date":1579932545381,"synopsis":"Dominica DeGrandis describes five patterns that steal time from teams and offers ways to visualize the theft for improved decision making. [https://www.youtube.com/watch?v=-TGJePmaaas youtube]"},{"slug":"time-travel","title":"Time travel","date":1496848515585,"synopsis":"In the beginning there was dark."},{"slug":"time-zone-problems","title":"Time Zone Problems","date":1543329660353,"synopsis":"Time seems really straightforward and turns out not to be."},{"slug":"transducers-data-pipelines","title":"Transducers: Data Pipelines","date":1548110696275,"synopsis":"Eric Elliott explains _Transducers: Efficient Data Processing Pipelines in JavaScript_ [https://medium.com/javascript-scene/transducers-efficient-data-processing-pipelines-in-javascript-7985330fe73d medium]"},{"slug":"transform-safety-practice","title":"Transform Safety Practice","date":1585626415652,"synopsis":"Safety II professionals: How resilience engineering can transform safety practice. Two modes for safety management: centralized control, or guided adaptability. Centralized control, labelled by Hollnagel as Safety-I, aims to align and control the organization and its people through the central determination of what is safe. Guided adaptability, or Safety-II, aims to enable the organization and its people to safely adapt to emergent situations and conditions. Safety-II has been presented as a paradigm shift in safety theory, but it has created practical d"},{"slug":"twilight-of-the-experts","title":"Twilight of the Experts","date":1549688084113,"synopsis":"Peter Alvaro argues why observability and fault injection is the only tractable future for addressing resilience of distributed systems.  Love this talk for concisely capturing a number of fundamental truths about distributed systems.  Undecided about the broad conclusion, but agree with pretty much every step and very much admire his reasoning. Twenty-four minutes of gold.  [https://www.youtube.com/watch?v=A-frep1y80s youtube]"},{"slug":"two-fundamental-abstractions","title":"Two Fundamental Abstractions","date":1566753284237,"synopsis":"André Staltz (known for other work in functional reactive programming) teaches higher-order functions from first principles using javascript in 30 minutes.  Conceptually grounds Iterables and Observables with the metaphor of getters and setters, and Input/Output. [https://www.youtube.com/watch?v=fdol03pcvMA youtube]"},{"slug":"two-tales-of-enterprise-software","title":"Two Tales of Enterprise Software","date":1525620642852,"synopsis":"One design pattern for an enterprise software business model creates an \"off-the-shelf solution\" to a complex problem.  There's a big price tag.  Also included is an equally big price tag for \"support and services\" to _customize_ the solution to _your specific business needs_.  But wait!  There's more!  It also comes with compelling whitepapers and testimonials explaining your business need to you."},{"slug":"typing-with-pleasure","title":"Typing with Pleasure","date":1503587438917,"synopsis":"Pavel Fatin discusses human and computer factors in reducing latency for typing.  [https://pavelfatin.com/typing-with-pleasure/ post]"},{"slug":"understand-matrix","title":"Understand Matrix","date":1527362697207,"synopsis":"The Matrix protocol is designed with your privacy and data sovereignty in mind. Because it is a decentralised, federated service with cryptographically-validated message integrity, there are a few important things to know before you use the Service."},{"slug":"unit-conversion","title":"Unit Conversion","date":1442193877631,"synopsis":"Units of measurement are how abstract numbers come to represent things in the real world.  Converting and composing units are a critical piece of science and engineering yet programming languages prefer to leave units out of the language.  Method plugins inclusion of units is exciting."},{"slug":"van-jacobson-talk-networking-at-google","title":"Van Jacobson talk Networking at Google","date":1562947569930,"synopsis":"Network innovation is stuck according to Van Jacobson.  With a metaphor of Copernican Revolution, he reminisces about the 60s and 70s when network innovation was stuck in circuit switching of the original phone network.  The invention of packet switching changed the center of the networked universe.  He argues for a similarly dramatic shift to named-data networking:  apply cryptography to data instead of pipes to address forces now limiting us. [https://www.youtube.com/watch?v=oCZMoY3q2uM youtube]"},{"slug":"vanishing-point","title":"Vanishing Point","date":1589898605052,"synopsis":"In 2003 I re-created an animation of a vanishing point in javascript and SVG.  The original animation was built with AutoCAD 10 and custom AUTOLISP scripts I created in the fall of 1990.  Happily amazed that 15 years later this code runs unchanged in modern browsers. [http://dobbse.net/thinair/2003/12/vanishing-point.html blog]"},{"slug":"vault-auth","title":"Vault Auth","date":1542043732965,"synopsis":"Vault has a feature that I really want to use... they promise the opportunity to set expiration on keys that is shorter than the time it would take to crack the keys if they were compromised."},{"slug":"velocity-san-jose-2019","title":"Velocity San Jose 2019","date":1561327224112,"synopsis":"\"Pay no attention to that man behind the curtain. The Great Oz has spoken.\" We are The Wizard of Oz: we show the world the magic of automation, yet there are people behind the curtain wiggling the levers of these complex systems. This Velocity conference shows we have internalized some of the lessons from Velocity NYC 2017 when David Woods and Richard Cook presented the STELLA report: the humans above the line of representation matter; we are starting to pay attention to relationships that cross that line."},{"slug":"view-from-outside-the-galaxy","title":"View from Outside the Galaxy","date":1542122795031,"synopsis":"Fly through the galaxy with Museum astrophysicist Jackie Faherty, who takes us on a dazzling tour of new research and data visualizations made possible by recently released data from the Gaia space telescope."},{"slug":"visualize-system-quality","title":"Visualize System Quality","date":1520402797927,"synopsis":"Colin Breck offers Quality Views to represent the system holistically, describing current investments, highlighting risks, and demonstrating how the system is evolving. They have been useful for communicating within our team, as well as externally, with both technical and non-technical stakeholders. They have been invaluable for aligning our mental models of the system. [http://blog.colinbreck.com/using-quality-views-to-communicate-software-quality-and-evolution/ 2016 article]"},{"slug":"visualizing-concurrency-in-go","title":"Visualizing Concurrency in Go","date":1504671603189,"synopsis":"WebGL visualizations clarify thinking about concurrency and parallelism. [https://divan.github.io/posts/go_concurrency_visualize link]"},{"slug":"visualizing-high-order-graphs","title":"Visualizing High-Order Graphs","date":1450365867957,"synopsis":"How might we draw meaningful diagrams of wiki that don't turn quickly into a fuzzball of links?"},{"slug":"webmention","title":"Webmention","date":1544414552392,"synopsis":"Webmention is a simple way to notify any URL when you mention it on your site. From the receiver's perspective, it's a way to request notifications when other sites mention it. [https://indiewebcamp.com/webmention Webmention] [https://www.w3.org/TR/webmention/ W3C]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1568327360543,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"what-is-cybernetics","title":"What is Cybernetics?","date":1557937881164,"synopsis":"Stafford Beer reminisces on the origins of cybernetics, a science of holism. [https://www.youtube.com/watch?v=JJ6orMfmorg youtube]"},{"slug":"what-matters-in-the-end","title":"What Matters in The End?","date":1557090699940,"synopsis":"It’s not do we fight, or do we give up? It’s what are we fighting for? People have priorities besides just surviving no matter what. You have reasons you want to be alive. What are those reasons? Because whatever you’re living for, along the way, we’ve got to make sure we don’t sacrifice it. Can we, along the way, whatever’s happening, can we enable it? Interview with Dr. Atul Gawande and his book, Being Mortal. [https://onbeing.org/programs/atul-gawande-what-matters-in-the-end/ interview] [https://onbeing.org/programs/atul-gawande-what-matters-in-the-en"},{"slug":"whats-in-a-gif","title":"What's In a GIF","date":1520649559994,"synopsis":"We sill start off by walking though the different parts of a GIF file. A GIF file is made up of a bunch of different \"blocks\" of data. The diagram shows all of the different types of blocks and where they belong in the file. At each branch you may go one way or the other. The large \"middle\" section can be repeated as many times as needed. "},{"slug":"which-javascript-framework","title":"Which Javascript Framework","date":1549403642874,"synopsis":"Every few months I loose hours surveying the javascript application framework landscape.  Kevin O'Shaughnessy wrote a synopsis of a 2016 talk by Rob Eisenberg and updated it in 2018.  That makes this wiki page 3rd hand information. [https://medium.com/@ZombieCodeKill/choosing-a-javascript-framework-535745d0ab90 medium]"},{"slug":"white-fragility","title":"White Fragility","date":1563735590358,"synopsis":"I feel compelled to read articles about white privilege and social justice. When I do, it often feels like an act of self-abuse. I feel triggered and defensive. Still I feel compelled. This paper is an example. I believe the content is valuable for me to learn and internalize, yet the language triggers my defenses and makes it hard to listen for the value hidden within. Does my experience in reading reflect the story the paper tells? [https://libjournal.uncg.edu/ijcp/article/viewFile/249/116 pdf]"},{"slug":"wiki-and-glitch","title":"Wiki and Glitch","date":1544649349811,"synopsis":"Daydreams about hosting wiki on glitch.com, combining dat, and gradually minimizing the server."},{"slug":"wiki-and-open-data","title":"Wiki and Open Data","date":1522820419800,"synopsis":"I found inspiration in learning about open data published by City of Boulder, County of Boulder, and State of Colorado.  Could this drive creation of El Dorado in wiki?"},{"slug":"wiki-as-flat-json-database","title":"Wiki as flat json database","date":1522853293918,"synopsis":"There is some interest in creating static HTML from a wiki.  Here is a pure javascript proof-of-concept."},{"slug":"wiki-config","title":"Wiki Config","date":1557943921572,"synopsis":"We share an example of our configuration for wiki to show how to set it up so all subdomains are owned by the same owner."},{"slug":"wiki-import","title":"Wiki Import","date":1531152376439,"synopsis":"Last week I had my first experience using wiki's import functionality.  Ward shared an `export.json` with a few words guidance: \"drag and drop on an empty wiki, then fork every page.\"  For two people familiar with running  wiki locally, this is an acceptable, if slightly awkward means of sharing semi-private information in the absence of network-hosted wikis behind the company firewall.  Here I describe that workflow, and daydream a minor improvement."},{"slug":"wiki-tools","title":"Wiki Tools","date":1564584710906,"synopsis":"Junk drawer for questions I ask often."},{"slug":"wiki-wandering","title":"Wiki Wandering","date":1503547845555,"synopsis":"[[Wiki Wandering]] in which I outline a new-to-me way to discover interesting work in the federation."},{"slug":"wont-start-an-envoy-company","title":"Won't Start an Envoy Company","date":1531666575249,"synopsis":"Envoy has gained exceptional traction since it was open sourced in fall of 2016.  Many investors suggested Matt Klein quit Lyft and start a platform company around Envoy.  He decided not to.  [https://medium.com/@mattklein123/optimizing-impact-why-i-will-not-start-an-envoy-platform-company-8904286658cb article] [https://twitter.com/mattklein123 @author]"},{"slug":"workflow-for-partitioning-complexity","title":"Workflow for Partitioning Complexity","date":1511279640067,"synopsis":"I can’t handle lots of complexity at once.  If I can change simple parts of complex programs, then I can still make changes. Complex changes paralyze me.  - Kent Beck"},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429288732439,"synopsis":"Writing in the presence of rampant forking calls into question what it means to write and how to do it well."},{"slug":"xkcd-1883-supervillain-plan","title":"xkcd 1883 supervillain plan","date":1513090074835,"synopsis":"It is devilishly difficult to reason about Time."},{"slug":"xkcd-1926-bad-code","title":"xkcd 1926 bad code","date":1526684910348,"synopsis":"Sometimes in this business we compose tools in terrible ways."},{"slug":"your-nan-is-my-zero","title":"Your NaN is My Zero","date":1518020468681,"synopsis":"I play a little game in my intro to wiki where we sing the 99 Bottles of Beer song. I thought a nice refinement to that page might add bottles back a case at a time."},{"slug":"youtube-audio-transcripts","title":"Youtube Audio Transcripts","date":1538068994219,"synopsis":"Youtube includes audio transcripts.  Here's where I found it in the UI (as of September 2018)."},{"slug":"juggling-kubernetes-clusters","title":"Juggling Kubernetes Clusters","date":1588872293155,"synopsis":"Because kubernetes is becoming so pervasive, one of the first obstacles to working with kubernetes is learning how to jump between different clusters. There are many, many ways to shave this yak. Here's the one I am settling into."}]